{
  "vicBot": {
    "brain": {
      "coding": {
        "typescript": "Typescript is a very powerful language built as a superset of Javascript",
        "react": "React library"
      },
      "sports": {
        "basketball": "How to shoot a jump shot"
      }
    },
    "id": "199A5B61C",
    "chronId": 1,
    "name": "vicBot",
    "dob": "1/7/2023, 4:01:16 PM",
    "personality": "refreshed",
    "cached": true,
    "residence": {
      "name": "Royals Point",
      "city": "Houston",
      "state": "Texas",
      "restaurants": [
        "Shipleys"
      ]
    },
    "bankBalance": 200
  },
  "vicBot2": {
    "brain": {
      "sports": {
        "baseball": "How to hit it out of the park"
      },
      "library": {
        "machineLearning": [
          "Machine Learning (ML) with AWS Lambda Part I Multipart Series.",
          "Part 1: Describe the machine learning model in terms of abstract thinking",
          "",
          "This year one of my knowledge-building goals is to learn about machine-learning and artifical intelligence. Other topics that peak my interest that coincide with these are robotics, automation, speech/text recognition, etc. I decided to focus on machine-learning this time around just to gather the conceptual knowledge of machine learning. Perhaps, it is not such a farfetched topic that requires years of Mathematics to begin. Perhaps, machine learning could be applied immediately to our present applications. That is what we will explore in this multipart article series. In this first part, we will describe the machine learning model in the simplest way possible, outlining the pieces needed to create a model. Keep in mind that we will be describing them in terms of abstract pieces, so try not to focus on the nomenclature of each abstract piece, but the function in terms of the others. ",
          "Definition of Machine Learning",
          "...",
          "So first off, what is machine learning? According to (https://github.com/topics/artificial-intelligence?l=javascript), Machine Learning (ML) is The branch of computer science dealing with the reproduction, or mimicking of human-level intelligence, self-awareness, knowledge, conscience, and thought in computer programs.",
          "Requirements of a ML Model",
          "-object (machine, learning subject)",
          "-dynamic environment (sources)",
          "-goal(overall goal), intentions (normal tendencies/personality), entities (variables, things that change depending on situation)",
          "Methodology",
          "-object (machine) serves as a listener/absorber of information (data)",
          "-sources serve data, new and updated (realtime)",
          "-sources send event triggers to object (polls/messages/notifications/alerts)",
          "-object can also request information and spend time consuming information from a particular source (reading/streaming/inputting/digesting)",
          "-lazy loading of information can also occur (reading data not in realtime, similar to updates that occur in the background, best when other processes/memory usage is low, can be a refreshing of information that is bound to change, to keep accuracy)",
          "-object maps data accordingly based on NoSQL database schema",
          "-i.e.",
          "Database Schema",
          "Good_vs_Bad {",
          "  good: [yes, no, maybe, not sure] String dropdown,",
          "  evil: [yes, no, maybe, not sure] String dropdown",
          "}",
          "-assign ratings/percentages to values (hot - cold)",
          "-use calculations to influence the \"personality\" of the object",
          "-calculations could come as an aggregate of each database's results.",
          " -new data comes in",
          " -object maps it for Good_vs_Bad",
          " -Data: 'There is a hurricane in Indonesia..'",
          " -Good_vs_Bad [",
          "   { id: 01, good: no, evil: not sure }",
          " -Total_Hurricanes_In_Indonesia [",
          "   { id: 01, name: 'HurricaneName', chronOrder: 153 }",
          " -based on the rating of the values, the object can determine the hurricane in Indonesia is not really evil, but is not too good either. (qualitative)",
          " -based on the chronOrder in the second database, the object can determine it is the 153rd occurence (quantitative)",
          "Continuity / Growth",
          "Purpose, Drive, Motivation",
          "Just like humans require a certain spark to get us out of bed every morning and to achieve our days in top quality, our machine learning model may/or may not require a foundational goal, purpose, or source of motivation. It could be as simple as \"the model wants to learn in order to improve <something>\". This provides a base case for a recursive learning function and other nested recursions and their base cases could be inspired by the drives and motivators. The reason why this is necessary is because it serves as a fallback so that the model doesn't spin in one direction. For example, without purpose, what would stop a model from learning one particular item over and over again for the sole random purpose of setting that record of learning it the most number of times. Purpose has to be guided and laid as a foundation by the developer. Perhaps to be progressed by the model as it improves its discovery, but there must be a foundation for an optimal model.",
          "Please let me know your thoughts on this article, and any suggestions that can improve this learning model will be greatly appreciated.",
          "Next: Part 2: Turning the Methodology into Pseudocode."
        ],
        "testBook5": [
          "God is good.",
          "True",
          "God is the best.",
          "God is amazing."
        ],
        "songLyrics": [
          "Legendary... legendary... algoriddim V.. algoriddim V",
          "Champion Sound",
          "Vibes"
        ],
        "testBook": [
          "Lord Jesus!",
          "Have mercy on our souls.",
          "Amen"
        ],
        "testBook2": [
          "victor",
          "is the best"
        ],
        "testBook3": [
          "victor",
          "is the best",
          "you are the pillar",
          "that holds my life",
          "Jesus"
        ],
        "testBook4": [
          "God is good.",
          "True"
        ]
      }
    },
    "id": "101A8B91C",
    "chronId": 2,
    "name": "vicBot2",
    "dob": "1/7/2023, 4:01:17 PM",
    "personality": {
      "mood": "discovery",
      "attitude": "none",
      "currentIQ": 1
    },
    "cached": true
  }
}